src/InformationRegisters/ИсторияПереносовСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияПереносовСобытий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кабинет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Профосмотры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Профосмотры</Name>
			<Comment>Хранит историю проведения и планирования профосмотров</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапланированная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПрофосмотров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредварительнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправившийВрач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаНаправления</Name>
					<Comment>Причина направления к врачу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПереноса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОсмотров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыНарядЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыНарядЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заказано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОсмотров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОсмотров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Направление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОчередьНаЗапись</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Профосмотр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовторныйПрием</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыСобытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыСобытия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеПодтверждена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтверждена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПациентОжидает</Name>
					<Comment>Для предварительной записи более не используется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНачат</Name>
					<Comment>Пациент в кресле</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемОкончен</Name>
					<Comment>Прием окончен</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНеСостоялся</Name>
					<Comment>Для предварительной записи более не используется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемОтменен</Name>
					<Comment>Прием отменен</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/ИсторияПереносовСобытий/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Процедура - Зафиксировать изменения события в истории.
//
// Параметры:
//  СобытиеОбъект	 - 	 - 
//
Процедура ЗафиксироватьИзмененияСобытияВИстории(СобытиеОбъект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(СобытиеОбъект.Ссылка) Или СобытиеОбъект.Услуги.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	  	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СобытиеУслуги.Ссылка.Дата КАК Дата,
	|	СобытиеУслуги.Сотрудник КАК Сотрудник,
	|	СобытиеУслуги.Помещение КАК Помещение,
	|	СобытиеУслуги.Ссылка.ДатаОкончания КАК ДатаОкончания,
	|	СобытиеУслуги.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ИЗ
	|	Документ.Событие.Услуги КАК СобытиеУслуги
	|ГДЕ
	|	СобытиеУслуги.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СобытиеОбъект.Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
    СтарыеДанныеСобытия = Новый Структура("Дата, Сотрудник, Помещение, ДатаОкончания, СтруктурнаяЕдиница");
	ЗаполнитьЗначенияСвойств(СтарыеДанныеСобытия, Выборка); 
	
	НовыеДанныеСобытия 	= Новый Структура();
	
	НовыеДанныеСобытия.Вставить("Дата"					, СобытиеОбъект.Дата);
	НовыеДанныеСобытия.Вставить("Сотрудник"				, СобытиеОбъект.Услуги[0].Сотрудник);
	НовыеДанныеСобытия.Вставить("Помещение"				, СобытиеОбъект.Услуги[0].Помещение);
	НовыеДанныеСобытия.Вставить("СтруктурнаяЕдиница"	, СобытиеОбъект.СтруктурнаяЕдиница);
	
	// Сравнивать будем параметры все кроме даты окончания, если изменилась только дата окончания не имеет смысла писать в историю переноса.
	
	СтарыеДанныеДляСравнения 	= ОбщегоНазначенияКлиентСервер.СкопироватьРекурсивно(СтарыеДанныеСобытия);
	СтарыеДанныеДляСравнения.Удалить("ДатаОкончания");
	
	Если ОбщегоНазначения.ДанныеСовпадают(СтарыеДанныеДляСравнения, НовыеДанныеСобытия) Тогда 
		Возврат;
	КонецЕсли;  
	
	//// Подготовим комментарий переноса.
	//	
	//КомментарийПереноса = СтрШаблон("%1 :", Справочники.Сотрудники.ПредставлениеФИОСотрудника(ПараметрыСеанса.ТекущийСотрудник)); 
	//
	//Если СтарыеДанныеСобытия.СтруктурнаяЕдиница <> НовыеДанныеСобытия.СтруктурнаяЕдиница Тогда
	//	КомментарийПереноса = ?(ЗначениеЗаполнено(КомментарийПереноса), КомментарийПереноса + Символы.ПС, КомментарийПереноса); 	
	//	КомментарийПереноса = КомментарийПереноса + СтрШаблон("Изменена клиника : %1 > %2", СтарыеДанныеСобытия.СтруктурнаяЕдиница, НовыеДанныеСобытия.СтруктурнаяЕдиница);
	//КонецЕсли;
	//
	//Если СтарыеДанныеСобытия.Дата <> НовыеДанныеСобытия.Дата Тогда
	//	
	//	Если НачалоДня(СтарыеДанныеСобытия.Дата) = НачалоДня(НовыеДанныеСобытия.Дата) Тогда
	//		ФорматнаяСтрока = "ДФ=ЧЧ:мм"; 
	//	Иначе 
	//		ФорматнаяСтрока = "dd.MM.yyyy ЧЧ:мм";
	//	КонецЕсли;
	//	
	//	ПредсталениеДатыНачало	= Формат(СтарыеДанныеСобытия.Дата, ФорматнаяСтрока); 
	//	ПредсталениеДатыКонец 	= Формат(НовыеДанныеСобытия.Дата, ФорматнаяСтрока);
	//	
	//	КомментарийПереноса = ?(ЗначениеЗаполнено(КомментарийПереноса), КомментарийПереноса + Символы.ПС, КомментарийПереноса); 	
	//	КомментарийПереноса = КомментарийПереноса + СтрШаблон("Изменена дата : %1 > %2", ПредсталениеДатыНачало, ПредсталениеДатыКонец);
	//КонецЕсли; 
	//
	//Если СтарыеДанныеСобытия.Сотрудник <> НовыеДанныеСобытия.Сотрудник Тогда
	//	КомментарийПереноса = ?(ЗначениеЗаполнено(КомментарийПереноса), КомментарийПереноса + Символы.ПС, КомментарийПереноса); 	
	//	КомментарийПереноса = КомментарийПереноса + СтрШаблон("Изменен врач : %1 > %2", Справочники.Сотрудники.ПредставлениеФИОСотрудника(СтарыеДанныеСобытия.Сотрудник), Справочники.Сотрудники.ПредставлениеФИОСотрудника(НовыеДанныеСобытия.Сотрудник));
	//КонецЕсли; 
	//
	//Если СтарыеДанныеСобытия.Помещение <> НовыеДанныеСобытия.Помещение Тогда
	//	КомментарийПереноса = ?(ЗначениеЗаполнено(КомментарийПереноса), КомментарийПереноса + Символы.ПС, КомментарийПереноса); 	
	//	КомментарийПереноса = КомментарийПереноса + СтрШаблон("Изменен кабинет : %1 > %2", СтарыеДанныеСобытия.Помещение, НовыеДанныеСобытия.Помещение);
	//КонецЕсли; 
	
	МенеджерЗаписи = РегистрыСведений.ИсторияПереносовСобытий.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.СтруктурнаяЕдиница 		= СтарыеДанныеСобытия.СтруктурнаяЕдиница; 
   	МенеджерЗаписи.Событие 					= СобытиеОбъект.Ссылка;	
	МенеджерЗаписи.ДатаВремя 				= СтарыеДанныеСобытия.Дата;
	МенеджерЗаписи.Сотрудник 				= СтарыеДанныеСобытия.Сотрудник; 
	МенеджерЗаписи.Кабинет 					= СтарыеДанныеСобытия.Помещение;	
	МенеджерЗаписи.ДатаОкончания			= СтарыеДанныеСобытия.ДатаОкончания;
	МенеджерЗаписи.Автор 					= ПараметрыСеанса.ТекущийСотрудник;
	//МенеджерЗаписи.КомментарийПереноса      = КомментарийПереноса; 
	
	Попытка 
		МенеджерЗаписи.Записать(Истина);
	Исключение 
		
	КонецПопытки; 
		
КонецПроцедуры 

// Функция - Получить данные перенесенных событий.
//
// Параметры:
//  НачалоПериода					 - 	 - 
//  КонецПериода					 - 	 - 
//  СтруктурнаяЕдиница				 - 	 - 
//  МассивСотрудников				 - 	 - 
//  МассивПомещений					 - 	 - 
//  ПолучитьМенеджерВременныхТаблиц	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеПеренесенныхСобытий(
	НачалоПериода,
	КонецПериода, 
	СтруктурнаяЕдиница,
	МассивСотрудников = Неопределено, 
	МассивПомещений = Неопределено,
	МассивДолжностей = Неопределено,
	МассивКлиентов = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
#Область Запрос

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсторияПереносовСобытий.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ИсторияПереносовСобытий.Событие КАК Событие,
	|	ИсторияПереносовСобытий.ДатаВремя КАК ДатаНачала,
	|	ИсторияПереносовСобытий.Сотрудник КАК Сотрудник,
	|	ИсторияПереносовСобытий.Сотрудник.Наименование КАК СотрудникНаименование,
	|	ИсторияПереносовСобытий.Кабинет КАК Помещение,
	|	ИсторияПереносовСобытий.Автор КАК Автор,
	|	ИсторияПереносовСобытий.ДатаОкончания КАК ДатаОкончания,
	|	ИСТИНА КАК ЭтоПеренос
	|ПОМЕСТИТЬ ВтДанныеПереносов
	|ИЗ
	|	РегистрСведений.ИсторияПереносовСобытий КАК ИсторияПереносовСобытий
	|ГДЕ
	|	ИсторияПереносовСобытий.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ИсторияПереносовСобытий.Событие.Проведен = ИСТИНА
	|	И ИсторияПереносовСобытий.ДатаВремя МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ИсторияПереносовСобытий.Сотрудник В(&МассивСотрудников)
	|	И ИсторияПереносовСобытий.Кабинет В(&МассивПомещений)
	|	И ИсторияПереносовСобытий.Сотрудник.Должность В(&МассивДолжностей)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Услуги.Ссылка КАК Событие,
	|	Услуги.Ссылка.УИД КАК УИДСобытия,
	|	Услуги.Ссылка.Контрагент КАК Контрагент,
	|	Услуги.Ссылка.Контрагент.Фамилия КАК КонтрагентФамилия,
	|	Услуги.Ссылка.Контрагент.Имя КАК КонтрагентИмя,
	|	Услуги.Ссылка.Контрагент.Отчество КАК КонтрагентОтчество,
	|	Услуги.Ссылка.Контрагент.Наименование КАК ФИОПациента,
	|	Услуги.Ссылка.Контрагент.ДатаРожденияКлиента КАК ДатаРожденияКлиента,
	|	Услуги.Ссылка.Контрагент.ТекущаяМедицинскаяКарта.КодБезНулей КАК КонтрагентТекущаяМедицинскаяКартаКодБезНулей,
	|	Услуги.Ссылка.Контрагент.ТекущаяМедицинскаяКарта КАК КонтрагентТекущаяМедицинскаяКарта,
	|	Услуги.Ссылка.Контрагент.Телефон КАК КонтрагентТелефон,
	|	Услуги.Ссылка.ТелефонныйЗвонок КАК ТелефонныйЗвонок,
	|	Услуги.Ссылка.ОснованиеРезерва КАК ОснованиеРезерва,
	|	Услуги.Ссылка.Комментарий КАК Комментарий,
	|	ВтДанныеПереносов.ДатаНачала КАК ДатаНачала,
	|	ВтДанныеПереносов.ДатаОкончания КАК ДатаОкончания,
	|	ВтДанныеПереносов.Сотрудник КАК Сотрудник,
	|	ВтДанныеПереносов.Сотрудник.Наименование КАК СотрудникНаименование,
	|	ВтДанныеПереносов.Помещение КАК Помещение,
	|	ВтДанныеПереносов.Помещение.Наименование КАК ПомещениеНаименование,
	|	Услуги.Номенклатура КАК Услуга,
	|	Услуги.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	Услуги.ПричинаЗаписи КАК ПричинаЗаписи,
	|	Услуги.ПризнакЗаблокированно КАК ПризнакЗаблокировано,
	|	Услуги.НомерСтроки - 1 КАК ИндексВТЧ,
	|	0 КАК НомерБлокаСобытий,
	|	Услуги.Ссылка.АвторДокумента КАК АвторДокумента,
	|	Услуги.Ссылка.Дата КАК ДатаСобытия,
	|	Услуги.Ссылка.Резерв КАК Резерв,
	|	Услуги.Ссылка.Статус КАК Статус,
	|	Услуги.Ссылка.ЦветФонаРезерва КАК ЦветФонаРезерва,
	|	ЛОЖЬ КАК ЕстьЗадолженность,
	|	ЛОЖЬ КАК ЕстьНезавершенныеНарядЗаказы,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыНарядЗаказа.Заказано) КАК ОбщийСтатусНезавершенныхНарядЗаказов,
	|	Услуги.Ссылка.ПолисМедСтрахования КАК ПолисМедСтрахования,
	|	Услуги.Ссылка.ПолисМедСтрахования.Договор КАК ПолисМедСтрахованияДоговор,
	|	Услуги.Ссылка.ПолисМедСтрахования.Договор.Контрагент КАК ПолисМедСтрахованияДоговорКонтрагент,
	|	Услуги.Ссылка.ПолисМедСтрахования.Договор.ПрограммаСтрахования КАК ПолисМедСтрахованияДоговорПрограммаСтрахования,
	|	Услуги.Ссылка.ПолисМедСтрахования.СтраховаяКомпания.КраткоеНаименование КАК ПолисМедСтрахованияКраткоеНаименованиеСтраховойКомпании,
	|	Услуги.Ссылка.ИдентификаторДиалога КАК ИдентификаторДиалога,
	|	Услуги.Ссылка.СсылкаНаПрием КАК СсылкаНаПрием,
	|	ИСТИНА КАК ЭтоПеренос
	|ПОМЕСТИТЬ ТаблицаПредварительныхЗаписей
	|ИЗ
	|	ВтДанныеПереносов КАК ВтДанныеПереносов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Событие.Услуги КАК Услуги
	|		ПО ВтДанныеПереносов.Событие = Услуги.Ссылка
	|ГДЕ
	|	ИСТИНА
	|	И &УсловиеКонтрагент
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Событие,
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПредварительныхЗаписей.Событие КАК Событие,
	|	ТаблицаПредварительныхЗаписей.УИДСобытия КАК УИДСобытия,
	|	ТаблицаПредварительныхЗаписей.Контрагент КАК Контрагент,
	|	ТаблицаПредварительныхЗаписей.КонтрагентФамилия КАК КонтрагентФамилия,
	|	ТаблицаПредварительныхЗаписей.КонтрагентИмя КАК КонтрагентИмя,
	|	ТаблицаПредварительныхЗаписей.КонтрагентОтчество КАК КонтрагентОтчество,
	|	ТаблицаПредварительныхЗаписей.ФИОПациента КАК ФИОПациента,
	|	ТаблицаПредварительныхЗаписей.ДатаРожденияКлиента КАК ДатаРожденияКлиента,
	|	ТаблицаПредварительныхЗаписей.КонтрагентТекущаяМедицинскаяКартаКодБезНулей КАК КонтрагентТекущаяМедицинскаяКартаКодБезНулей,
	|	ТаблицаПредварительныхЗаписей.КонтрагентТекущаяМедицинскаяКарта КАК КонтрагентТекущаяМедицинскаяКарта,
	|	ТаблицаПредварительныхЗаписей.КонтрагентТелефон КАК КонтрагентТелефон,
	|	ТаблицаПредварительныхЗаписей.ТелефонныйЗвонок КАК ТелефонныйЗвонок,
	|	ТаблицаПредварительныхЗаписей.ОснованиеРезерва КАК ОснованиеРезерва,
	|	ТаблицаПредварительныхЗаписей.Комментарий КАК Комментарий,
	|	ТаблицаПредварительныхЗаписей.ДатаНачала КАК ДатаНачала,
	|	ТаблицаПредварительныхЗаписей.ДатаОкончания КАК ДатаОкончания,
	|	ТаблицаПредварительныхЗаписей.Сотрудник КАК Сотрудник,
	|	ТаблицаПредварительныхЗаписей.СотрудникНаименование КАК СотрудникНаименование,
	|	ТаблицаПредварительныхЗаписей.Помещение КАК Помещение,
	|	ТаблицаПредварительныхЗаписей.ПомещениеНаименование КАК ПомещениеНаименование,
	|	ТаблицаПредварительныхЗаписей.Услуга КАК Услуга,
	|	ТаблицаПредварительныхЗаписей.НоменклатураНаименование КАК НоменклатураНаименование,
	|	ТаблицаПредварительныхЗаписей.ПричинаЗаписи КАК ПричинаЗаписи,
	|	ТаблицаПредварительныхЗаписей.ПризнакЗаблокировано КАК ПризнакЗаблокировано,
	|	ТаблицаПредварительныхЗаписей.ИндексВТЧ КАК ИндексВТЧ,
	|	ТаблицаПредварительныхЗаписей.НомерБлокаСобытий КАК НомерБлокаСобытий,
	|	ТаблицаПредварительныхЗаписей.АвторДокумента КАК АвторДокумента,
	|	ТаблицаПредварительныхЗаписей.ДатаСобытия КАК ДатаСобытия,
	|	ТаблицаПредварительныхЗаписей.Резерв КАК Резерв,
	|	ТаблицаПредварительныхЗаписей.Статус КАК Статус,
	|	ТаблицаПредварительныхЗаписей.ЦветФонаРезерва КАК ЦветФонаРезерва,
	|	ТаблицаПредварительныхЗаписей.ЕстьЗадолженность КАК ЕстьЗадолженность,
	|	ТаблицаПредварительныхЗаписей.ЕстьНезавершенныеНарядЗаказы КАК ЕстьНезавершенныеНарядЗаказы,
	|	ТаблицаПредварительныхЗаписей.ОбщийСтатусНезавершенныхНарядЗаказов КАК ОбщийСтатусНезавершенныхНарядЗаказов,
	|	ТаблицаПредварительныхЗаписей.ПолисМедСтрахования КАК ПолисМедСтрахования,
	|	ТаблицаПредварительныхЗаписей.ПолисМедСтрахованияДоговор КАК ПолисМедСтрахованияДоговор,
	|	ТаблицаПредварительныхЗаписей.ПолисМедСтрахованияДоговорКонтрагент КАК ПМСДоговорКонтрагент,
	|	ТаблицаПредварительныхЗаписей.ПолисМедСтрахованияДоговорПрограммаСтрахования КАК ПМСДоговорПрограммаСтрахования,
	|	ТаблицаПредварительныхЗаписей.ПолисМедСтрахованияКраткоеНаименованиеСтраховойКомпании КАК ПМСКраткоеНаименованиеСтраховойКомпании,
	|	ВЫБОР
	|		КОГДА Профосмотры.ПредварительнаяЗапись ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПоНаправлению,
	|	ТаблицаПредварительныхЗаписей.ИдентификаторДиалога КАК ИдентификаторДиалога,
	|	ТаблицаПредварительныхЗаписей.СсылкаНаПрием КАК СсылкаНаПрием,
	|	ТаблицаПредварительныхЗаписей.ЭтоПеренос КАК ЭтоПеренос
	|ИЗ
	|	ТаблицаПредварительныхЗаписей КАК ТаблицаПредварительныхЗаписей
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Профосмотры КАК Профосмотры
	|		ПО ТаблицаПредварительныхЗаписей.Событие = Профосмотры.ПредварительнаяЗапись
	|			И ТаблицаПредварительныхЗаписей.Контрагент = Профосмотры.Контрагент
	|			И (Профосмотры.ВидОсмотра = ЗНАЧЕНИЕ(Перечисление.ВидыОсмотров.Направление))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Событие,
	|	Сотрудник,
	|	Контрагент,
	|	Помещение,
	|	ДатаНачала"; 
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("ДатаНачала"				, НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания"			, КонецПериода);
	Запрос.УстановитьПараметр("МассивСотрудников"		, МассивСотрудников);
    Запрос.УстановитьПараметр("МассивПомещений"			, МассивПомещений);
	Запрос.УстановитьПараметр("МассивДолжностей"		, МассивДолжностей);
	Запрос.УстановитьПараметр("Контрагент"              , МассивКлиентов);	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"      , СтруктурнаяЕдиница);
	
	УсловиеКонтрагент         = ?(ЗначениеЗаполнено(МассивКлиентов), "И Услуги.Ссылка.Контрагент В (&Контрагент)", "");
	Запрос.Текст              = СтрЗаменить(Запрос.Текст, "И &УсловиеКонтрагент", УсловиеКонтрагент);
	
	Если Не ЗначениеЗаполнено(МассивСотрудников) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИсторияПереносовСобытий.Сотрудник В(&МассивСотрудников)", "");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МассивПомещений) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИсторияПереносовСобытий.Кабинет В(&МассивПомещений)", "");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МассивДолжностей) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИсторияПереносовСобытий.Сотрудник.Должность В(&МассивДолжностей)", "");
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
			
Конецфункции

// Процедура - Дополнить таблицу событий переносами.
//
// Параметры:
//  ДатаВремяНачала		 - 	 - 
//  ДатаВремяОкончания	 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
//  СотрудникСегмент	 - 	 - 
//  Помещение			 - 	 - 
//
Процедура ДополнитьТаблицуСобытийПереносами(	
	ДатаВремяНачалаОтбор, 
	ДатаВремяОкончанияОтбор,
	СтруктурнаяЕдиницаОтбор,
	СотрудникСегментОтбор,
	ПомещениеОтбор,
	Статус,
	КлиентСегмент,
	ТаблицаСобытий) Экспорт
	
	ТаблицаСобытий.Колонки.Добавить("ЭтоПеренос"			, Новый ОписаниеТипов("Булево"));
	
	Если Не Статус = Перечисления.СтатусыСобытия.ПриемОтменен Тогда
		Возврат;	
	КонецЕсли;
	
	МассивКлиентов    = Документы.Событие.ПереданныйПараметрВМассивЭлементов(КлиентСегмент, Тип("СправочникСсылка.Контрагенты") , Тип("СправочникСсылка.СегментыКонтрагентов"));	
	
	Если ЗначениеЗаполнено(СотрудникСегментОтбор) Тогда
		
		// Если передана должность.
		Если ТипЗнч(СотрудникСегментОтбор) = Тип("СправочникСсылка.Должности") Тогда
			Должность = СотрудникСегментОтбор;  		
		ИначеЕсли ТипЗнч(СотрудникСегментОтбор) = Тип("Строка")
			Или (ТипЗнч(СотрудникСегментОтбор) = Тип("Массив") И СотрудникСегментОтбор.Количество() > 0 И ТипЗнч(СотрудникСегментОтбор[0]) = Тип("Строка")) Тогда
			
			МассивСотрудников = Неопределено; 
		Иначе
			МассивСотрудников = Новый Массив();
			МассивСотрудников.Добавить(СотрудникСегментОтбор); 			
		КонецЕсли;
				
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПомещениеОтбор) Тогда
		
		Если ТипЗнч(ПомещениеОтбор) = Тип("Строка")
			Или (ТипЗнч(ПомещениеОтбор) = Тип("Массив") И ПомещениеОтбор.Количество() > 0 И ТипЗнч(ПомещениеОтбор[0]) = Тип("Строка")) Тогда
			
			МассивПомещений = Неопределено;
		Иначе 
			МассивПомещений = Новый Массив();
			МассивПомещений.Добавить(ПомещениеОтбор);
		КонецЕсли;
		
	КонецЕсли;
	
	ТаблицаИсточник = ПолучитьДанныеПеренесенныхСобытий(ДатаВремяНачалаОтбор, ДатаВремяОкончанияОтбор, СтруктурнаяЕдиницаОтбор, МассивСотрудников, МассивПомещений, Должность, МассивКлиентов);  
	
	Общегоназначенияклиентсервер.ДополнитьТаблицу(ТаблицаИсточник, ТаблицаСобытий); 
		
КонецПроцедуры

#КонецОбласти
